In [1]:
import pandas as pd

In [2]:
url = 'http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic.txt'
data = pd.read_csv(url)

In [3]:
data

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male
...,...,...,...,...,...,...,...,...,...,...,...
1308,1309,3rd,0,"Zakarian, Mr Artun",NaN,NaN,NaN,NaN,NaN,NaN,male
1309,1310,3rd,0,"Zakarian, Mr Maprieder",NaN,NaN,NaN,NaN,NaN,NaN,male
1310,1311,3rd,0,"Zenn, Mr Philip",NaN,NaN,NaN,NaN,NaN,NaN,male
1311,1312,3rd,0,"Zievens, Rene",NaN,NaN,NaN,NaN,NaN,NaN,female
1312,1313,3rd,0,"Zimmerman, Leo",NaN,NaN,NaN,NaN,NaN,NaN,male

In [4]:
x = data[['pclass','age','sex']]
y = data['survived']

In [6]:
x['age'].fillna(x['age'].mean(),inplace=True)
x = x.to_dict(orient='records')

In [8]:
from sklearn.model_selection import  train_test_split
xTrain,xTest,yTrain,yTest = train_test_split(x,y)

In [11]:
from sklearn.feature_extraction import DictVectorizer
tr = DictVectorizer()
xTrain = tr.fit_transform(xTrain)
xTest = tr.transform(xTest)

In [22]:
from sklearn.tree import DecisionTreeClassifier, export_graphviz
em = DecisionTreeClassifier(criterion='entropy',max_depth=5)
em.fit(xTrain, yTrain)
#
score = em.score(xTest, yTest)
print(score)
# 可视化决策树
export_graphviz(em,out_file='out/titanic.dot',feature_names =tr.get_feature_names())

0.8449848024316109